{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AppleRHI",
			"Children": [
				{
					"Source": {
						"Text": "-sm6 is selected but Mac requires OS 15 to support SM6"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MetalRHIOptionsError"
				},
				{
					"Source": {
						"Text": "No Targeted RHI is set for this project, defaulting to SM5"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MetalMissingTargetError"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallError",
			"Children": [
				{
					"Source": {
						"Text": "A file access error has occurred. Please check your running processes."
					},
					"Translation": {
						"Text": "Ошибка доступа к файлу. Проверьте запущенные процессы."
					},
					"Key": "BuildPatchInstallShortError_MoveFileToInstall"
				},
				{
					"Source": {
						"Text": "A file corruption has occurred. Please try again."
					},
					"Translation": {
						"Text": "Файл был повреждён. Повторите попытку позже."
					},
					"Key": "BuildPatchInstallShortError_FileConstructionFail"
				},
				{
					"Source": {
						"Text": "An unknown error ocurred. Please contact support."
					},
					"Translation": {
						"Text": "Произошла неизвестная ошибка. Обратитесь в службу поддержки."
					},
					"Key": "BuildPatchInstallShortError_InvalidOrMax"
				},
				{
					"Source": {
						"Text": "Could not download patch data. Please check your internet connection, and try again."
					},
					"Translation": {
						"Text": "Не удалось загрузить пакет обновления. Проверьте соединение с интернетом и повторите попытку позже."
					},
					"Key": "BuildPatchInstallShortError_DownloadError"
				},
				{
					"Source": {
						"Text": "Low-level failure to write files to disk during installation. Verify there is sufficient disk space. {RequiredBytes} more is required."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InstallationWriteFailed"
				},
				{
					"Source": {
						"Text": "Maximum path length exceeded. Please specify a shorter install location."
					},
					"Translation": {
						"Text": "Превышена максимально допустимая длина пути установки. Укажите более короткий путь установки."
					},
					"Key": "BuildPatchInstallShortError_PathLengthExceeded"
				},
				{
					"Source": {
						"Text": "Not enough disk space available. Please free up some disk space and try again."
					},
					"Translation": {
						"Text": "Недостаточно свободного места. Освободите место и попробуйте заново."
					},
					"Key": "BuildPatchInstallShortError_OutOfDiskSpace"
				},
				{
					"Source": {
						"Text": "Patching service could not start. Please contact support."
					},
					"Translation": {
						"Text": "Невозможно начать установку обновления. Обратитесь в службу поддержки."
					},
					"Key": "BuildPatchInstallShortError_ApplicationError"
				},
				{
					"Source": {
						"Text": "The application is closing."
					},
					"Translation": {
						"Text": "Приложение будет закрыто."
					},
					"Key": "BuildPatchInstallShortError_ApplicationClosing"
				},
				{
					"Source": {
						"Text": "The application's uninstall action has failed to execute. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "BuildPatchInstallShortError_UninstallCustomActionError"
				},
				{
					"Source": {
						"Text": "The following directory could not be created.\n{0}"
					},
					"Translation": {
						"Text": "Невозможно создать указанную папку.\n{0}"
					},
					"Key": "MissingStageDirectory"
				},
				{
					"Source": {
						"Text": "The installation directory could not be created.\n{0}"
					},
					"Translation": {
						"Text": "Невозможно создать папку установки.\n{0}"
					},
					"Key": "MissingInstallDirectory"
				},
				{
					"Source": {
						"Text": "The installation is corrupt. Please contact support."
					},
					"Translation": {
						"Text": "Ошибка установки. Обратитесь в службу поддержки."
					},
					"Key": "BuildPatchInstallShortError_BuildCorrupt"
				},
				{
					"Source": {
						"Text": "The installer failed to initialize. Please contact support."
					},
					"Translation": {
						"Text": "Ошибка запуска программы установки. Обратитесь в службу поддержки."
					},
					"Key": "BuildPatchInstallShortError_InitializationError"
				},
				{
					"Source": {
						"Text": "The necessary prerequisites have failed to install. Please contact support."
					},
					"Translation": {
						"Text": "Ошибка установки необходимых компонентов. Обратитесь в службу поддержки."
					},
					"Key": "BuildPatchInstallShortError_PrerequisiteError"
				},
				{
					"Source": {
						"Text": "The operation was successful."
					},
					"Translation": {
						"Text": "Операция выполнена успешно."
					},
					"Key": "BuildPatchInstallShortError_NoError"
				},
				{
					"Source": {
						"Text": "There is not enough space at {Location}\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation": {
						"Text": "{Location}: недостаточно свободного места.\nТребуется {RequiredBytes}.\nДоступно {AvailableBytes}.\nНеобходимо ещё {SpaceAdditional} для завершения установки."
					},
					"Key": "InstallDirectoryDiskSpace"
				},
				{
					"Source": {
						"Text": "There is not enough space on your device.\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation": {
						"Text": "Недостаточно свободного места на устройстве.\nТребуется {RequiredBytes}.\nДоступно {AvailableBytes}.\nНеобходимо ещё {SpaceAdditional} для завершения установки."
					},
					"Key": "InstallDirectoryDiskSpaceDevice"
				},
				{
					"Source": {
						"Text": "This installation could not continue as the required decryption data is missing. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MissingEncryptionKeyForNonPreload"
				},
				{
					"Source": {
						"Text": "This installation could not continue as the required decryption data is not valid. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InvalidEncryptionKeyForNonPreload"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EmptyCloudDirectories"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": "Установка была прервана из-за ошибки конфигурации. Обратитесь в службу поддержки."
					},
					"Key": "InvalidInstallTags"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InvalidInstallToMemory"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InvalidMemoryConstructionConfig"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "VerifyOnlyActionMixed"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a prerequisite configuration issue. Please contact support."
					},
					"Translation": {
						"Text": "Установка была прервана из-за ошибки предварительной конфигурации. Обратитесь в службу поддержки."
					},
					"Key": "MissingPrereqForPrereqOnlyInstall"
				},
				{
					"Source": {
						"Text": "User cancelled."
					},
					"Translation": {
						"Text": "Отменено пользователем."
					},
					"Key": "BuildPatchInstallShortError_UserCanceled"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallProgress",
			"Children": [
				{
					"Source": {
						"Text": "Cleaning up"
					},
					"Translation": {
						"Text": "Очистка"
					},
					"Key": "EBuildPatchProgress_CleanUp"
				},
				{
					"Source": {
						"Text": "Complete"
					},
					"Translation": {
						"Text": "Выполнено"
					},
					"Key": "EBuildPatchProgress_Complete"
				},
				{
					"Source": {
						"Text": "Downloading"
					},
					"Translation": {
						"Text": "Загрузка"
					},
					"Key": "EBuildPatchProgress_Downloading"
				},
				{
					"Source": {
						"Text": "Initializing"
					},
					"Translation": {
						"Text": "Инициализация"
					},
					"Key": "EBuildPatchProgress_Initialising"
				},
				{
					"Source": {
						"Text": "Installing"
					},
					"Translation": {
						"Text": "Установка"
					},
					"Key": "EBuildPatchProgress_Installing"
				},
				{
					"Source": {
						"Text": "Paused"
					},
					"Translation": {
						"Text": "Пауза"
					},
					"Key": "EBuildPatchProgress_Paused"
				},
				{
					"Source": {
						"Text": "Prerequisites"
					},
					"Translation": {
						"Text": "Требования"
					},
					"Key": "EBuildPatchProgress_PrerequisitesInstall"
				},
				{
					"Source": {
						"Text": "Queued"
					},
					"Translation": {
						"Text": "В очереди"
					},
					"Key": "EBuildPatchProgress_Queued"
				},
				{
					"Source": {
						"Text": "Resuming"
					},
					"Translation": {
						"Text": "Возобновление"
					},
					"Key": "EBuildPatchProgress_Resuming"
				},
				{
					"Source": {
						"Text": "Verifying"
					},
					"Translation": {
						"Text": "Проверка"
					},
					"Key": "EBuildPatchProgress_BuildVerification"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstaller",
			"Children": [
				{
					"Source": {
						"Text": "Please Wait"
					},
					"Translation": {
						"Text": "Подождите..."
					},
					"Key": "BuildPatchInstaller_GenericProgress"
				},
				{
					"Source": {
						"Text": "{Current} / {Total} ({Speed}/sec)"
					},
					"Translation": {
						"Text": "{Current} из {Total} ({Speed}/сек.)"
					},
					"Key": "BuildPatchInstaller_DownloadSpeedFormat"
				}
			]
		},
		{
			"Namespace": "DynamicRHI",
			"Children": [
				{
					"Source": {
						"Text": "NullDrv failure?"
					},
					"Translation": {
						"Text": "Ошибка NullDrv?"
					},
					"Key": "NullDrvFailure"
				}
			]
		},
		{
			"Namespace": "GenericPlatform",
			"Children": [
				{
					"Source": {
						"Text": "File Manager"
					},
					"Translation": {
						"Text": "Диспетчер файлов"
					},
					"Key": "FileManagerName"
				}
			]
		},
		{
			"Namespace": "InputKeys",
			"Children": [
				{
					"Source": {
						"Text": "Acceleration"
					},
					"Translation": {
						"Text": "Ускорение"
					},
					"Key": "Acceleration"
				},
				{
					"Source": {
						"Text": "Ampersand"
					},
					"Translation": {
						"Text": "&"
					},
					"Key": "Ampersand"
				},
				{
					"Source": {
						"Text": "Android"
					},
					"Translation": {
						"Text": "Android"
					},
					"Key": "AndroidSubCateogry"
				},
				{
					"Source": {
						"Text": "Android Back"
					},
					"Translation": {
						"Text": "Android: назад"
					},
					"Key": "Android_Back"
				},
				{
					"Source": {
						"Text": "Android Menu"
					},
					"Translation": {
						"Text": "Android: меню"
					},
					"Key": "Android_Menu"
				},
				{
					"Source": {
						"Text": "Android Volume Down"
					},
					"Translation": {
						"Text": "Android: уменьшение громкости"
					},
					"Key": "Android_Volume_Down"
				},
				{
					"Source": {
						"Text": "Android Volume Up"
					},
					"Translation": {
						"Text": "Android: увеличение громкости"
					},
					"Key": "Android_Volume_Up"
				},
				{
					"Source": {
						"Text": "Any Key"
					},
					"Translation": {
						"Text": "Любая клавиша"
					},
					"Key": "AnyKey"
				},
				{
					"Source": {
						"Text": "Apostrophe"
					},
					"Translation": {
						"Text": "Апостроф"
					},
					"Key": "Apostrophe"
				},
				{
					"Source": {
						"Text": "Asterisk"
					},
					"Translation": {
						"Text": "Звёздочка"
					},
					"Key": "Asterix"
				},
				{
					"Source": {
						"Text": "Backslash"
					},
					"Translation": {
						"Text": "\\"
					},
					"Key": "Backslash"
				},
				{
					"Source": {
						"Text": "Backspace"
					},
					"Translation": {
						"Text": "Backspace"
					},
					"Key": "BackSpace"
				},
				{
					"Source": {
						"Text": "Caps"
					},
					"Translation": {
						"Text": "Caps"
					},
					"Key": "CapsLockShort"
				},
				{
					"Source": {
						"Text": "Caps Lock"
					},
					"Translation": {
						"Text": "Caps Lock"
					},
					"Key": "CapsLock"
				},
				{
					"Source": {
						"Text": "Caret"
					},
					"Translation": {
						"Text": "^"
					},
					"Key": "Caret"
				},
				{
					"Source": {
						"Text": "Colon"
					},
					"Translation": {
						"Text": "Двоеточие"
					},
					"Key": "Colon"
				},
				{
					"Source": {
						"Text": "Comma"
					},
					"Translation": {
						"Text": "Запятая"
					},
					"Key": "Comma"
				},
				{
					"Source": {
						"Text": "Del"
					},
					"Translation": {
						"Text": "Del"
					},
					"Key": "DeleteShort"
				},
				{
					"Source": {
						"Text": "Delete"
					},
					"Translation": {
						"Text": "Delete"
					},
					"Key": "Delete"
				},
				{
					"Source": {
						"Text": "Dollar"
					},
					"Translation": {
						"Text": "$"
					},
					"Key": "Dollar"
				},
				{
					"Source": {
						"Text": "Down"
					},
					"Translation": {
						"Text": "Вниз"
					},
					"Key": "Down"
				},
				{
					"Source": {
						"Text": "End"
					},
					"Translation": {
						"Text": "End"
					},
					"Key": "End"
				},
				{
					"Source": {
						"Text": "Enter"
					},
					"Translation": {
						"Text": "Enter"
					},
					"Key": "Enter"
				},
				{
					"Source": {
						"Text": "Equals"
					},
					"Translation": {
						"Text": "="
					},
					"Key": "Equals"
				},
				{
					"Source": {
						"Text": "Esc"
					},
					"Translation": {
						"Text": "Esc"
					},
					"Key": "EscapeShort"
				},
				{
					"Source": {
						"Text": "Escape"
					},
					"Translation": {
						"Text": "Escape"
					},
					"Key": "Escape"
				},
				{
					"Source": {
						"Text": "Exclamation"
					},
					"Translation": {
						"Text": "!"
					},
					"Key": "Exclamation"
				},
				{
					"Source": {
						"Text": "F1"
					},
					"Translation": {
						"Text": "F1"
					},
					"Key": "F1"
				},
				{
					"Source": {
						"Text": "F10"
					},
					"Translation": {
						"Text": "F10"
					},
					"Key": "F10"
				},
				{
					"Source": {
						"Text": "F11"
					},
					"Translation": {
						"Text": "F11"
					},
					"Key": "F11"
				},
				{
					"Source": {
						"Text": "F12"
					},
					"Translation": {
						"Text": "F12"
					},
					"Key": "F12"
				},
				{
					"Source": {
						"Text": "F2"
					},
					"Translation": {
						"Text": "F2"
					},
					"Key": "F2"
				},
				{
					"Source": {
						"Text": "F3"
					},
					"Translation": {
						"Text": "F3"
					},
					"Key": "F3"
				},
				{
					"Source": {
						"Text": "F4"
					},
					"Translation": {
						"Text": "F4"
					},
					"Key": "F4"
				},
				{
					"Source": {
						"Text": "F5"
					},
					"Translation": {
						"Text": "F5"
					},
					"Key": "F5"
				},
				{
					"Source": {
						"Text": "F6"
					},
					"Translation": {
						"Text": "F6"
					},
					"Key": "F6"
				},
				{
					"Source": {
						"Text": "F7"
					},
					"Translation": {
						"Text": "F7"
					},
					"Key": "F7"
				},
				{
					"Source": {
						"Text": "F8"
					},
					"Translation": {
						"Text": "F8"
					},
					"Key": "F8"
				},
				{
					"Source": {
						"Text": "F9"
					},
					"Translation": {
						"Text": "F9"
					},
					"Key": "F9"
				},
				{
					"Source": {
						"Text": "Flick"
					},
					"Translation": {
						"Text": "Быстрое отклонение"
					},
					"Key": "Gesture_Flick"
				},
				{
					"Source": {
						"Text": "Fn+Delete"
					},
					"Translation": {
						"Text": "Fn+Delete"
					},
					"Key": "ForwardDelete"
				},
				{
					"Source": {
						"Text": "Gamepad"
					},
					"Translation": {
						"Text": "Геймпад"
					},
					"Key": "GamepadSubCategory"
				},
				{
					"Source": {
						"Text": "Gamepad A"
					},
					"Translation": {
						"Text": "Геймпад: кнопка A"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Bottom"
				},
				{
					"Source": {
						"Text": "Gamepad B"
					},
					"Translation": {
						"Text": "Геймпад: кнопка B"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Back"
					},
					"Translation": {
						"Text": "Геймпад: кнопка «Просмотр»"
					},
					"Key": "XBoxOne_Gamepad_Special_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Circle"
					},
					"Translation": {
						"Text": "Контроллер: кнопка «круг»"
					},
					"Key": "PS4_Gamepad_FaceButton_Right"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Down"
					},
					"Translation": {
						"Text": "Геймпад: крестовина вниз"
					},
					"Key": "Gamepad_DPad_Down"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Left"
					},
					"Translation": {
						"Text": "Геймпад: крестовина влево"
					},
					"Key": "Gamepad_DPad_Left"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Right"
					},
					"Translation": {
						"Text": "Геймпад: крестовина вправо"
					},
					"Key": "Gamepad_DPad_Right"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Up"
					},
					"Translation": {
						"Text": "Геймпад: крестовина вверх"
					},
					"Key": "Gamepad_DPad_Up"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Bottom"
					},
					"Translation": {
						"Text": "Геймпад: нижняя лицевая кнопка"
					},
					"Key": "Gamepad_FaceButton_Bottom"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Left"
					},
					"Translation": {
						"Text": "Геймпад: левая лицевая кнопка"
					},
					"Key": "Gamepad_FaceButton_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Right"
					},
					"Translation": {
						"Text": "Геймпад: правая лицевая кнопка"
					},
					"Key": "Gamepad_FaceButton_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Top"
					},
					"Translation": {
						"Text": "Геймпад: верхняя лицевая кнопка"
					},
					"Key": "Gamepad_FaceButton_Top"
				},
				{
					"Source": {
						"Text": "Gamepad L1"
					},
					"Translation": {
						"Text": "Контроллер: кнопка L1"
					},
					"Key": "PS4_Gamepad_LeftShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad L2"
					},
					"Translation": {
						"Text": "Контроллер: кнопка L2"
					},
					"Key": "PS4_Gamepad_LeftTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad L2 Axis"
					},
					"Translation": {
						"Text": "Контроллер: ось L2"
					},
					"Key": "PS4_Gamepad_LeftTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad L3"
					},
					"Translation": {
						"Text": "Контроллер: кнопка L3"
					},
					"Key": "PS4_Gamepad_LeftThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Left Shoulder"
					},
					"Translation": {
						"Text": "Геймпад: левый бампер"
					},
					"Key": "Gamepad_LeftShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Геймпад: двухмерная ось левого мини-джойстика"
					},
					"Key": "Gamepad_Left2D"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Button"
					},
					"Translation": {
						"Text": "Геймпад: левый мини-джойстик — нажатие"
					},
					"Key": "Gamepad_LeftThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Down"
					},
					"Translation": {
						"Text": "Геймпад: левый мини-джойстик вниз"
					},
					"Key": "Gamepad_LeftStick_Down"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Left"
					},
					"Translation": {
						"Text": "Геймпад: левый мини-джойстик влево"
					},
					"Key": "Gamepad_LeftStick_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Right"
					},
					"Translation": {
						"Text": "Геймпад: левый мини-джойстик вправо"
					},
					"Key": "Gamepad_LeftStick_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Up"
					},
					"Translation": {
						"Text": "Геймпад: левый мини-джойстик вверх"
					},
					"Key": "Gamepad_LeftStick_Up"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Геймпад: ось X левого мини-джойстика"
					},
					"Key": "Gamepad_LeftX"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Геймпад: ось Y левого мини-джойстика"
					},
					"Key": "Gamepad_LeftY"
				},
				{
					"Source": {
						"Text": "Gamepad Left Trigger"
					},
					"Translation": {
						"Text": "Геймпад: левый триггер"
					},
					"Key": "Gamepad_LeftTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad Left Trigger Axis"
					},
					"Translation": {
						"Text": "Геймпад: ось левого триггера"
					},
					"Key": "Gamepad_LeftTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad Options"
					},
					"Translation": {
						"Text": "Параметры контроллера"
					},
					"Key": "PS4_Gamepad_Special_Right"
				},
				{
					"Source": {
						"Text": "Gamepad R1"
					},
					"Translation": {
						"Text": "Контроллер: кнопка R1"
					},
					"Key": "PS4_Gamepad_RightShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad R2"
					},
					"Translation": {
						"Text": "Контроллер: кнопка R2"
					},
					"Key": "PS4_Gamepad_RightTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad R2 Axis"
					},
					"Translation": {
						"Text": "Контроллер: ось R2"
					},
					"Key": "PS4_Gamepad_RightTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad R3"
					},
					"Translation": {
						"Text": "Контроллер: кнопка R3"
					},
					"Key": "PS4_Gamepad_RightThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Right Shoulder"
					},
					"Translation": {
						"Text": "Геймпад: правый бампер"
					},
					"Key": "Gamepad_RightShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Геймпад: двухмерная ось правого мини-джойстика"
					},
					"Key": "Gamepad_Right2D"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Button"
					},
					"Translation": {
						"Text": "Геймпад: правый мини-джойстик — нажатие"
					},
					"Key": "Gamepad_RightThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Down"
					},
					"Translation": {
						"Text": "Геймпад: правый мини-джойстик вниз"
					},
					"Key": "Gamepad_RightStick_Down"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Left"
					},
					"Translation": {
						"Text": "Геймпад: правый мини-джойстик влево"
					},
					"Key": "Gamepad_RightStick_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Right"
					},
					"Translation": {
						"Text": "Геймпад: правый мини-джойстик вправо"
					},
					"Key": "Gamepad_RightStick_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Up"
					},
					"Translation": {
						"Text": "Геймпад: правый мини-джойстик вверх"
					},
					"Key": "Gamepad_RightStick_Up"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Геймпад: ось X правого мини-джойстика"
					},
					"Key": "Gamepad_RightX"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Геймпад: ось Y правого мини-джойстика"
					},
					"Key": "Gamepad_RightY"
				},
				{
					"Source": {
						"Text": "Gamepad Right Trigger"
					},
					"Translation": {
						"Text": "Геймпад: правый триггер"
					},
					"Key": "Gamepad_RightTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad Right Trigger Axis"
					},
					"Translation": {
						"Text": "Геймпад: ось правого триггера"
					},
					"Key": "Gamepad_RightTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad Special Left"
					},
					"Translation": {
						"Text": "Геймпад: специальная левая кнопка"
					},
					"Key": "Gamepad_Special_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Special Right"
					},
					"Translation": {
						"Text": "Геймпад: специальная правая кнопка"
					},
					"Key": "Gamepad_Special_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Square"
					},
					"Translation": {
						"Text": "Контроллер: кнопка «квадрат»"
					},
					"Key": "PS4_Gamepad_FaceButton_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Start"
					},
					"Translation": {
						"Text": "Геймпад: кнопка «Меню»"
					},
					"Key": "XBoxOne_Gamepad_Special_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Touchpad Button"
					},
					"Translation": {
						"Text": "Контроллер: кнопка сенсорной панели"
					},
					"Key": "PS4_Gamepad_Special_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Touchpad Touched"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PS4_Gamepad_Special_Left_Touched"
				},
				{
					"Source": {
						"Text": "Gamepad Triangle"
					},
					"Translation": {
						"Text": "Контроллер: кнопка «треугольник»"
					},
					"Key": "PS4_Gamepad_FaceButton_Top"
				},
				{
					"Source": {
						"Text": "Gamepad X"
					},
					"Translation": {
						"Text": "Контроллер: кнопка «крест»"
					},
					"Key": "PS4_Gamepad_FaceButton_Bottom"
				},
				{
					"Source": {
						"Text": "Gamepad X"
					},
					"Translation": {
						"Text": "Геймпад: кнопка X"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Y"
					},
					"Translation": {
						"Text": "Геймпад: кнопка Y"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Top"
				},
				{
					"Source": {
						"Text": "Gesture"
					},
					"Translation": {
						"Text": "Жест"
					},
					"Key": "GestureSubCateogry"
				},
				{
					"Source": {
						"Text": "Global Back"
					},
					"Translation": {
						"Text": "Общее: назад"
					},
					"Key": "Global_Back"
				},
				{
					"Source": {
						"Text": "Global Menu"
					},
					"Translation": {
						"Text": "Общее: меню"
					},
					"Key": "Global_Menu"
				},
				{
					"Source": {
						"Text": "Global Pause"
					},
					"Translation": {
						"Text": "Общее: пауза"
					},
					"Key": "Global_Pause"
				},
				{
					"Source": {
						"Text": "Global Play"
					},
					"Translation": {
						"Text": "Общее: воспроизведение"
					},
					"Key": "Global_Play"
				},
				{
					"Source": {
						"Text": "Global View"
					},
					"Translation": {
						"Text": "Общее: просмотр"
					},
					"Key": "Global_View"
				},
				{
					"Source": {
						"Text": "Gravity"
					},
					"Translation": {
						"Text": "Гравитация"
					},
					"Key": "Gravity"
				},
				{
					"Source": {
						"Text": "HTC Vive"
					},
					"Translation": {
						"Text": "HTC Vive"
					},
					"Key": "ViveSubCategory"
				},
				{
					"Source": {
						"Text": "Home"
					},
					"Translation": {
						"Text": "Home"
					},
					"Key": "Home"
				},
				{
					"Source": {
						"Text": "Hyphen"
					},
					"Translation": {
						"Text": "Дефис"
					},
					"Key": "Hyphen"
				},
				{
					"Source": {
						"Text": "Ins"
					},
					"Translation": {
						"Text": "Ins"
					},
					"Key": "InsertShort"
				},
				{
					"Source": {
						"Text": "Insert"
					},
					"Translation": {
						"Text": "Insert"
					},
					"Key": "Insert"
				},
				{
					"Source": {
						"Text": "Keyboard"
					},
					"Translation": {
						"Text": "Клавиатура"
					},
					"Key": "KeyboardSubCategory"
				},
				{
					"Source": {
						"Text": "LMB"
					},
					"Translation": {
						"Text": "ЛКМ"
					},
					"Key": "LeftMouseButtonShort"
				},
				{
					"Source": {
						"Text": "Left"
					},
					"Translation": {
						"Text": "Влево"
					},
					"Key": "Left"
				},
				{
					"Source": {
						"Text": "Left Alt"
					},
					"Translation": {
						"Text": "Левый Alt"
					},
					"Key": "LeftAlt"
				},
				{
					"Source": {
						"Text": "Left Bracket"
					},
					"Translation": {
						"Text": "["
					},
					"Key": "LeftBracket"
				},
				{
					"Source": {
						"Text": "Left Cmd"
					},
					"Translation": {
						"Text": "Левая Cmd"
					},
					"Key": "LeftCommand"
				},
				{
					"Source": {
						"Text": "Left Ctrl"
					},
					"Translation": {
						"Text": "Левый Ctrl"
					},
					"Key": "LeftControl"
				},
				{
					"Source": {
						"Text": "Left Mouse Button"
					},
					"Translation": {
						"Text": "ЛКМ"
					},
					"Key": "LeftMouseButton"
				},
				{
					"Source": {
						"Text": "Left Parantheses"
					},
					"Translation": {
						"Text": "("
					},
					"Key": "LeftParantheses"
				},
				{
					"Source": {
						"Text": "Left Shift"
					},
					"Translation": {
						"Text": "Левый Shift"
					},
					"Key": "LeftShift"
				},
				{
					"Source": {
						"Text": "Long Press"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gesture_LongPress"
				},
				{
					"Source": {
						"Text": "Middle Mouse Button"
					},
					"Translation": {
						"Text": "СКМ"
					},
					"Key": "MiddleMouseButton"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Grip"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): рукоятка"
					},
					"Key": "MixedReality_Left_Grip_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Menu"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): кнопка «Меню»"
					},
					"Key": "MixedReality_Left_Menu_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): 2D-ось мини-джойстика"
					},
					"Key": "MixedReality_Left_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Button"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): кнопка мини-джойстика"
					},
					"Key": "MixedReality_Left_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Down"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): мини-джойстик вниз"
					},
					"Key": "MixedReality_Left_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Left"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): мини-джойстик влево"
					},
					"Key": "MixedReality_Left_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Right"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): мини-джойстик вправо"
					},
					"Key": "MixedReality_Left_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Up"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): мини-джойстик вверх"
					},
					"Key": "MixedReality_Left_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): ось X мини-джойстика"
					},
					"Key": "MixedReality_Left_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): ось Y мини-джойстика"
					},
					"Key": "MixedReality_Left_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): 2D-ось сенсорной панели"
					},
					"Key": "MixedReality_Left_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Button"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): кнопка сенсорной панели"
					},
					"Key": "MixedReality_Left_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Down"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): сенсорная панель, нажатие вниз"
					},
					"Key": "MixedReality_Left_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Left"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): сенсорная панель, нажатие влево"
					},
					"Key": "MixedReality_Left_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Right"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): сенсорная панель, нажатие вправо"
					},
					"Key": "MixedReality_Left_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Touch"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): касание сенсорной панели"
					},
					"Key": "MixedReality_Left_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Up"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): сенсорная панель, нажатие вверх"
					},
					"Key": "MixedReality_Left_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad X"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): ось X сенсорной панели"
					},
					"Key": "MixedReality_Left_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Y"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): ось Y сенсорной панели"
					},
					"Key": "MixedReality_Left_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trigger"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): триггер"
					},
					"Key": "MixedReality_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (Л): ось триггера"
					},
					"Key": "MixedReality_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Grip"
					},
					"Translation": {
						"Text": "Mixed Reality (П): рукоятка"
					},
					"Key": "MixedReality_Right_Grip_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Menu"
					},
					"Translation": {
						"Text": "Mixed Reality (П): кнопка «Меню»"
					},
					"Key": "MixedReality_Right_Menu_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (П): 2D-ось мини-джойстика"
					},
					"Key": "MixedReality_Right_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Button"
					},
					"Translation": {
						"Text": "Mixed Reality (П): кнопка мини-джойстика"
					},
					"Key": "MixedReality_Right_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Down"
					},
					"Translation": {
						"Text": "Mixed Reality (П): мини-джойстик вниз"
					},
					"Key": "MixedReality_Right_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Left"
					},
					"Translation": {
						"Text": "Mixed Reality (П): мини-джойстик влево"
					},
					"Key": "MixedReality_Right_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Right"
					},
					"Translation": {
						"Text": "Mixed Reality (П): мини-джойстик вправо"
					},
					"Key": "MixedReality_Right_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Up"
					},
					"Translation": {
						"Text": "Mixed Reality (П): мини-джойстик вверх"
					},
					"Key": "MixedReality_Right_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (П): ось X мини-джойстика"
					},
					"Key": "MixedReality_Right_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (П): ось Y мини-джойстика"
					},
					"Key": "MixedReality_Right_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (П): 2D-ось сенсорной панели"
					},
					"Key": "MixedReality_Right_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Button"
					},
					"Translation": {
						"Text": "Mixed Reality (П): кнопка сенсорной панели"
					},
					"Key": "MixedReality_Right_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Down"
					},
					"Translation": {
						"Text": "Mixed Reality (П): сенсорная панель, нажатие вниз"
					},
					"Key": "MixedReality_Right_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Left"
					},
					"Translation": {
						"Text": "Mixed Reality (П): сенсорная панель, нажатие влево"
					},
					"Key": "MixedReality_Right_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Right"
					},
					"Translation": {
						"Text": "Mixed Reality (П): сенсорная панель, нажатие вправо"
					},
					"Key": "MixedReality_Right_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Touch"
					},
					"Translation": {
						"Text": "Mixed Reality (П): касание сенсорной панели"
					},
					"Key": "MixedReality_Right_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Up"
					},
					"Translation": {
						"Text": "Mixed Reality (П): сенсорная панель, нажатие вверх"
					},
					"Key": "MixedReality_Right_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad X"
					},
					"Translation": {
						"Text": "Mixed Reality (П): ось X сенсорной панели"
					},
					"Key": "MixedReality_Right_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Y"
					},
					"Translation": {
						"Text": "Mixed Reality (П): ось Y сенсорной панели"
					},
					"Key": "MixedReality_Right_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trigger"
					},
					"Translation": {
						"Text": "Mixed Reality (П): триггер"
					},
					"Key": "MixedReality_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Mixed Reality (П): ось триггера"
					},
					"Key": "MixedReality_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Motion"
					},
					"Translation": {
						"Text": "Движение"
					},
					"Key": "MotionSubCateogry"
				},
				{
					"Source": {
						"Text": "Mouse"
					},
					"Translation": {
						"Text": "Мышь"
					},
					"Key": "MouseSubCategory"
				},
				{
					"Source": {
						"Text": "Mouse Wheel Axis"
					},
					"Translation": {
						"Text": "Ось колеса мыши"
					},
					"Key": "MouseWheelAxis"
				},
				{
					"Source": {
						"Text": "Mouse Wheel Down"
					},
					"Translation": {
						"Text": "Кол. мыши вниз"
					},
					"Key": "MouseScrollDown"
				},
				{
					"Source": {
						"Text": "Mouse Wheel Up"
					},
					"Translation": {
						"Text": "Кол. мыши вверх"
					},
					"Key": "MouseScrollUp"
				},
				{
					"Source": {
						"Text": "Mouse X"
					},
					"Translation": {
						"Text": "Движение мыши по оси X"
					},
					"Key": "MouseX"
				},
				{
					"Source": {
						"Text": "Mouse XY 2D-Axis"
					},
					"Translation": {
						"Text": "Мышь: двухмерная ось XY"
					},
					"Key": "Mouse2D"
				},
				{
					"Source": {
						"Text": "Mouse Y"
					},
					"Translation": {
						"Text": "Движение мыши по оси Y"
					},
					"Key": "MouseY"
				},
				{
					"Source": {
						"Text": "Num *"
					},
					"Translation": {
						"Text": "* (цифр. кл.)"
					},
					"Key": "Multiply"
				},
				{
					"Source": {
						"Text": "Num +"
					},
					"Translation": {
						"Text": "+ (цифр. кл.)"
					},
					"Key": "Add"
				},
				{
					"Source": {
						"Text": "Num -"
					},
					"Translation": {
						"Text": "- (цифр. кл.)"
					},
					"Key": "Subtract"
				},
				{
					"Source": {
						"Text": "Num ."
					},
					"Translation": {
						"Text": ". (цифр. кл.)"
					},
					"Key": "Decimal"
				},
				{
					"Source": {
						"Text": "Num /"
					},
					"Translation": {
						"Text": "/ (цифр. кл.)"
					},
					"Key": "Divide"
				},
				{
					"Source": {
						"Text": "Num 0"
					},
					"Translation": {
						"Text": "0 (цифр. кл.)"
					},
					"Key": "NumPadZero"
				},
				{
					"Source": {
						"Text": "Num 1"
					},
					"Translation": {
						"Text": "1 (цифр. кл.)"
					},
					"Key": "NumPadOne"
				},
				{
					"Source": {
						"Text": "Num 2"
					},
					"Translation": {
						"Text": "2 (цифр. кл.)"
					},
					"Key": "NumPadTwo"
				},
				{
					"Source": {
						"Text": "Num 3"
					},
					"Translation": {
						"Text": "3 (цифр. кл.)"
					},
					"Key": "NumPadThree"
				},
				{
					"Source": {
						"Text": "Num 4"
					},
					"Translation": {
						"Text": "4 (цифр. кл.)"
					},
					"Key": "NumPadFour"
				},
				{
					"Source": {
						"Text": "Num 5"
					},
					"Translation": {
						"Text": "5 (цифр. кл.)"
					},
					"Key": "NumPadFive"
				},
				{
					"Source": {
						"Text": "Num 6"
					},
					"Translation": {
						"Text": "6 (цифр. кл.)"
					},
					"Key": "NumPadSix"
				},
				{
					"Source": {
						"Text": "Num 7"
					},
					"Translation": {
						"Text": "7 (цифр. кл.)"
					},
					"Key": "NumPadSeven"
				},
				{
					"Source": {
						"Text": "Num 8"
					},
					"Translation": {
						"Text": "8 (цифр. кл.)"
					},
					"Key": "NumPadEight"
				},
				{
					"Source": {
						"Text": "Num 9"
					},
					"Translation": {
						"Text": "9 (цифр. кл.)"
					},
					"Key": "NumPadNine"
				},
				{
					"Source": {
						"Text": "Num Lock"
					},
					"Translation": {
						"Text": "Num Lock"
					},
					"Key": "NumLock"
				},
				{
					"Source": {
						"Text": "Oculus Touch"
					},
					"Translation": {
						"Text": "Oculus Touch"
					},
					"Key": "OculusTouchSubCategory"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Grip"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): рукоятка"
					},
					"Key": "OculusTouch_Left_Grip_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Grip Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): ось рукоятки"
					},
					"Key": "OculusTouch_Left_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Menu"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): кнопка «Меню»"
					},
					"Key": "OculusTouch_Left_Menu_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): 2D-ось мини-джойстика"
					},
					"Key": "OculusTouch_Left_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Button"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): кнопка мини-джойстика"
					},
					"Key": "OculusTouch_Left_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Down"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): мини-джойстик вниз"
					},
					"Key": "OculusTouch_Left_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Left"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): мини-джойстик влево"
					},
					"Key": "OculusTouch_Left_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Right"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): мини-джойстик вправо"
					},
					"Key": "OculusTouch_Left_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): касание мини-джойстика"
					},
					"Key": "OculusTouch_Left_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Up"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): мини-джойстик вверх"
					},
					"Key": "OculusTouch_Left_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): ось X мини-джойстика"
					},
					"Key": "OculusTouch_Left_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): ось Y мини-джойстика"
					},
					"Key": "OculusTouch_Left_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Trigger"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): триггер"
					},
					"Key": "OculusTouch_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): ось триггера"
					},
					"Key": "OculusTouch_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Trigger Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): касание триггера"
					},
					"Key": "OculusTouch_Left_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) X Press"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): нажатие кнопки X"
					},
					"Key": "OculusTouch_Left_X_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) X Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): касание кнопки X"
					},
					"Key": "OculusTouch_Left_X_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Y Press"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): нажатие кнопки Y"
					},
					"Key": "OculusTouch_Left_Y_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Y Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (Л): касание кнопки Y"
					},
					"Key": "OculusTouch_Left_Y_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) A Press"
					},
					"Translation": {
						"Text": "Oculus Touch (П): нажатие кнопки A"
					},
					"Key": "OculusTouch_Right_A_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) A Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (П): касание кнопки A"
					},
					"Key": "OculusTouch_Right_A_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) B Press"
					},
					"Translation": {
						"Text": "Oculus Touch (П): нажатие кнопки B"
					},
					"Key": "OculusTouch_Right_B_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) B Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (П): касание кнопки B"
					},
					"Key": "OculusTouch_Right_B_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Grip"
					},
					"Translation": {
						"Text": "Oculus Touch (П): рукоятка"
					},
					"Key": "OculusTouch_Right_Grip_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Grip Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (П): ось рукоятки"
					},
					"Key": "OculusTouch_Right_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (П): 2D-ось мини-джойстика"
					},
					"Key": "OculusTouch_Right_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Button"
					},
					"Translation": {
						"Text": "Oculus Touch (П): кнопка мини-джойстика"
					},
					"Key": "OculusTouch_Right_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Down"
					},
					"Translation": {
						"Text": "Oculus Touch (П): мини-джойстик вниз"
					},
					"Key": "OculusTouch_Right_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Left"
					},
					"Translation": {
						"Text": "Oculus Touch (П): мини-джойстик влево"
					},
					"Key": "OculusTouch_Right_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Right"
					},
					"Translation": {
						"Text": "Oculus Touch (П): мини-джойстик вправо"
					},
					"Key": "OculusTouch_Right_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (П): касание мини-джойстика"
					},
					"Key": "OculusTouch_Right_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Up"
					},
					"Translation": {
						"Text": "Oculus Touch (П): мини-джойстик вверх"
					},
					"Key": "OculusTouch_Right_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (П): ось X мини-джойстика"
					},
					"Key": "OculusTouch_Right_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (П): ось Y мини-джойстика"
					},
					"Key": "OculusTouch_Right_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Trigger"
					},
					"Translation": {
						"Text": "Oculus Touch (П): триггер"
					},
					"Key": "OculusTouch_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Oculus Touch (П): ось триггера"
					},
					"Key": "OculusTouch_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Trigger Touch"
					},
					"Translation": {
						"Text": "Oculus Touch (П): касание триггера"
					},
					"Key": "OculusTouch_Right_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Page Down"
					},
					"Translation": {
						"Text": "Page Down"
					},
					"Key": "PageDown"
				},
				{
					"Source": {
						"Text": "Page Up"
					},
					"Translation": {
						"Text": "Page Up"
					},
					"Key": "PageUp"
				},
				{
					"Source": {
						"Text": "Pan"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gesture_Pan"
				},
				{
					"Source": {
						"Text": "Pause"
					},
					"Translation": {
						"Text": "Pause"
					},
					"Key": "Pause"
				},
				{
					"Source": {
						"Text": "Period"
					},
					"Translation": {
						"Text": "Точка"
					},
					"Key": "Period"
				},
				{
					"Source": {
						"Text": "PgDn"
					},
					"Translation": {
						"Text": "PgDn"
					},
					"Key": "PageDownShort"
				},
				{
					"Source": {
						"Text": "PgUp"
					},
					"Translation": {
						"Text": "PgUp"
					},
					"Key": "PageUpShort"
				},
				{
					"Source": {
						"Text": "Pinch"
					},
					"Translation": {
						"Text": "Сведение/разведение пальцев"
					},
					"Key": "Gesture_Pinch"
				},
				{
					"Source": {
						"Text": "Quote"
					},
					"Translation": {
						"Text": "Кавычки"
					},
					"Key": "Quote"
				},
				{
					"Source": {
						"Text": "RMB"
					},
					"Translation": {
						"Text": "ПКМ"
					},
					"Key": "RightMouseButtonShort"
				},
				{
					"Source": {
						"Text": "Right"
					},
					"Translation": {
						"Text": "Вправо"
					},
					"Key": "Right"
				},
				{
					"Source": {
						"Text": "Right Alt"
					},
					"Translation": {
						"Text": "Правый Alt"
					},
					"Key": "RightAlt"
				},
				{
					"Source": {
						"Text": "Right Bracket"
					},
					"Translation": {
						"Text": "]"
					},
					"Key": "RightBracket"
				},
				{
					"Source": {
						"Text": "Right Cmd"
					},
					"Translation": {
						"Text": "Правая Cmd"
					},
					"Key": "RightCommand"
				},
				{
					"Source": {
						"Text": "Right Ctrl"
					},
					"Translation": {
						"Text": "Правый Ctrl"
					},
					"Key": "RightControl"
				},
				{
					"Source": {
						"Text": "Right Mouse Button"
					},
					"Translation": {
						"Text": "ПКМ"
					},
					"Key": "RightMouseButton"
				},
				{
					"Source": {
						"Text": "Right Parantheses"
					},
					"Translation": {
						"Text": ")"
					},
					"Key": "RightParantheses"
				},
				{
					"Source": {
						"Text": "Right Shift"
					},
					"Translation": {
						"Text": "Правый Shift"
					},
					"Key": "RightShift"
				},
				{
					"Source": {
						"Text": "Rotate"
					},
					"Translation": {
						"Text": "Поворот"
					},
					"Key": "Gesture_Rotate"
				},
				{
					"Source": {
						"Text": "Rotation Rate"
					},
					"Translation": {
						"Text": "Скорость поворота"
					},
					"Key": "RotationRate"
				},
				{
					"Source": {
						"Text": "Scroll Lock"
					},
					"Translation": {
						"Text": "Scroll Lock"
					},
					"Key": "ScrollLock"
				},
				{
					"Source": {
						"Text": "Semicolon"
					},
					"Translation": {
						"Text": "Точка с запятой"
					},
					"Key": "Semicolon"
				},
				{
					"Source": {
						"Text": "Slash"
					},
					"Translation": {
						"Text": "/"
					},
					"Key": "Slash"
				},
				{
					"Source": {
						"Text": "Space"
					},
					"Translation": {
						"Text": "Пробел"
					},
					"Key": "SpaceBarShort"
				},
				{
					"Source": {
						"Text": "Space Bar"
					},
					"Translation": {
						"Text": "Пробел"
					},
					"Key": "SpaceBar"
				},
				{
					"Source": {
						"Text": "SpecialGamepad"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SpecialGamepadSubCategory"
				},
				{
					"Source": {
						"Text": "Steam"
					},
					"Translation": {
						"Text": "Steam"
					},
					"Key": "SteamSubCateogry"
				},
				{
					"Source": {
						"Text": "Steam Back Left"
					},
					"Translation": {
						"Text": "Steam Controller: задняя левая кнопка"
					},
					"Key": "Steam_Back_Left"
				},
				{
					"Source": {
						"Text": "Steam Back Right"
					},
					"Translation": {
						"Text": "Steam Controller: задняя правая кнопка"
					},
					"Key": "Steam_Back_Right"
				},
				{
					"Source": {
						"Text": "Steam Touch 0"
					},
					"Translation": {
						"Text": "Steam Controller: сенсорная кнопка 0"
					},
					"Key": "Steam_Touch_0"
				},
				{
					"Source": {
						"Text": "Steam Touch 1"
					},
					"Translation": {
						"Text": "Steam Controller: сенсорная кнопка 1"
					},
					"Key": "Steam_Touch_1"
				},
				{
					"Source": {
						"Text": "Steam Touch 2"
					},
					"Translation": {
						"Text": "Steam Controller: сенсорная кнопка 2"
					},
					"Key": "Steam_Touch_2"
				},
				{
					"Source": {
						"Text": "Steam Touch 3"
					},
					"Translation": {
						"Text": "Steam Controller: сенсорная кнопка 3"
					},
					"Key": "Steam_Touch_3"
				},
				{
					"Source": {
						"Text": "Tab"
					},
					"Translation": {
						"Text": "Tab"
					},
					"Key": "Tab"
				},
				{
					"Source": {
						"Text": "Tap"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gesture_Tap"
				},
				{
					"Source": {
						"Text": "Thumb Mouse Button"
					},
					"Translation": {
						"Text": "Бок. кнопка мыши"
					},
					"Key": "ThumbMouseButton"
				},
				{
					"Source": {
						"Text": "Thumb Mouse Button 2"
					},
					"Translation": {
						"Text": "Бок. кн. мыши 2"
					},
					"Key": "ThumbMouseButton2"
				},
				{
					"Source": {
						"Text": "Tilt"
					},
					"Translation": {
						"Text": "Наклон"
					},
					"Key": "Tilt"
				},
				{
					"Source": {
						"Text": "Touch"
					},
					"Translation": {
						"Text": "Касание"
					},
					"Key": "TouchSubCateogry"
				},
				{
					"Source": {
						"Text": "Touch {0}"
					},
					"Translation": {
						"Text": "Касание {0}"
					},
					"Key": "TouchFormat"
				},
				{
					"Source": {
						"Text": "Touchpad Button X Axis"
					},
					"Translation": {
						"Text": "Ось X кнопки сенсорной панели"
					},
					"Key": "Gamepad_Special_Left_X"
				},
				{
					"Source": {
						"Text": "Touchpad Button Y Axis"
					},
					"Translation": {
						"Text": "Ось Y кнопки сенсорной панели"
					},
					"Key": "Gamepad_Special_Left_Y"
				},
				{
					"Source": {
						"Text": "Touchpad Touched"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gamepad_Special_Left_Touched"
				},
				{
					"Source": {
						"Text": "Underscore"
					},
					"Translation": {
						"Text": "Подчёркивание"
					},
					"Key": "Underscore"
				},
				{
					"Source": {
						"Text": "Up"
					},
					"Translation": {
						"Text": "Вверх"
					},
					"Key": "Up"
				},
				{
					"Source": {
						"Text": "Valve Index"
					},
					"Translation": {
						"Text": "Valve Index"
					},
					"Key": "ValveIndexSubCategory"
				},
				{
					"Source": {
						"Text": "Valve Index (L) A Press"
					},
					"Translation": {
						"Text": "Valve Index (Л): нажатие кнопки A"
					},
					"Key": "ValveIndex_Left_A_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) A Touch"
					},
					"Translation": {
						"Text": "Valve Index (Л): касание кнопки A"
					},
					"Key": "ValveIndex_Left_A_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) B Press"
					},
					"Translation": {
						"Text": "Valve Index (Л): нажатие кнопки B"
					},
					"Key": "ValveIndex_Left_B_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) B Touch"
					},
					"Translation": {
						"Text": "Valve Index (Л): касание кнопки B"
					},
					"Key": "ValveIndex_Left_B_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Grip Axis"
					},
					"Translation": {
						"Text": "Valve Index (Л): ось рукоятки"
					},
					"Key": "ValveIndex_Left_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Grip Force"
					},
					"Translation": {
						"Text": "Valve Index (Л): сжатие рукоятки"
					},
					"Key": "ValveIndex_Left_Grip_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index (Л): 2D-ось мини-джойстика"
					},
					"Key": "ValveIndex_Left_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Button"
					},
					"Translation": {
						"Text": "Valve Index (Л): кнопка мини-джойстика"
					},
					"Key": "ValveIndex_Left_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Down"
					},
					"Translation": {
						"Text": "Valve Index (Л): мини-джойстик вниз"
					},
					"Key": "ValveIndex_Left_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Left"
					},
					"Translation": {
						"Text": "Valve Index (Л): мини-джойстик влево"
					},
					"Key": "ValveIndex_Left_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Right"
					},
					"Translation": {
						"Text": "Valve Index (Л): мини-джойстик вправо"
					},
					"Key": "ValveIndex_Left_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Valve Index (Л): касание мини-джойстика"
					},
					"Key": "ValveIndex_Left_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Up"
					},
					"Translation": {
						"Text": "Valve Index (Л): мини-джойстик вверх"
					},
					"Key": "ValveIndex_Left_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Valve Index (Л): ось X мини-джойстика"
					},
					"Key": "ValveIndex_Left_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Valve Index (Л): ось Y мини-джойстика"
					},
					"Key": "ValveIndex_Left_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index (Л): 2D-ось сенсорной панели"
					},
					"Key": "ValveIndex_Left_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Down"
					},
					"Translation": {
						"Text": "Valve Index (Л): сенсорная панель, нажатие вниз"
					},
					"Key": "ValveIndex_Left_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Force"
					},
					"Translation": {
						"Text": "Valve Index (Л): нажатие на сенсорную панель"
					},
					"Key": "ValveIndex_Left_Trackpad_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Left"
					},
					"Translation": {
						"Text": "Valve Index (Л): сенсорная панель, нажатие влево"
					},
					"Key": "ValveIndex_Left_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Right"
					},
					"Translation": {
						"Text": "Valve Index (Л): сенсорная панель, нажатие вправо"
					},
					"Key": "ValveIndex_Left_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Touch"
					},
					"Translation": {
						"Text": "Valve Index (Л): касание сенсорной панели"
					},
					"Key": "ValveIndex_Left_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Up"
					},
					"Translation": {
						"Text": "Valve Index (Л): сенсорная панель, нажатие вверх"
					},
					"Key": "ValveIndex_Left_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad X"
					},
					"Translation": {
						"Text": "Valve Index (Л): ось X сенсорной панели"
					},
					"Key": "ValveIndex_Left_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Y"
					},
					"Translation": {
						"Text": "Valve Index (Л): ось Y сенсорной панели"
					},
					"Key": "ValveIndex_Left_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trigger"
					},
					"Translation": {
						"Text": "Valve Index (Л): триггер"
					},
					"Key": "ValveIndex_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Valve Index (Л): ось триггера"
					},
					"Key": "ValveIndex_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trigger Touch"
					},
					"Translation": {
						"Text": "Valve Index (Л): касание триггера"
					},
					"Key": "ValveIndex_Left_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) A Press"
					},
					"Translation": {
						"Text": "Valve Index (П): нажатие кнопки A"
					},
					"Key": "ValveIndex_Right_A_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) A Touch"
					},
					"Translation": {
						"Text": "Valve Index (П): касание кнопки A"
					},
					"Key": "ValveIndex_Right_A_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) B Press"
					},
					"Translation": {
						"Text": "Valve Index (П): нажатие кнопки B"
					},
					"Key": "ValveIndex_Right_B_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) B Touch"
					},
					"Translation": {
						"Text": "Valve Index (П): касание кнопки B"
					},
					"Key": "ValveIndex_Right_B_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Grip Axis"
					},
					"Translation": {
						"Text": "Valve Index (П): ось рукоятки"
					},
					"Key": "ValveIndex_Right_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Grip Force"
					},
					"Translation": {
						"Text": "Valve Index (П): сжатие рукоятки"
					},
					"Key": "ValveIndex_Right_Grip_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index (П): 2D-ось мини-джойстика"
					},
					"Key": "ValveIndex_Right_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Button"
					},
					"Translation": {
						"Text": "Valve Index (П): кнопка мини-джойстика"
					},
					"Key": "ValveIndex_Right_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Down"
					},
					"Translation": {
						"Text": "Valve Index (П): мини-джойстик вниз"
					},
					"Key": "ValveIndex_Right_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Left"
					},
					"Translation": {
						"Text": "Valve Index (П): мини-джойстик влево"
					},
					"Key": "ValveIndex_Right_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Right"
					},
					"Translation": {
						"Text": "Valve Index (П): мини-джойстик вправо"
					},
					"Key": "ValveIndex_Right_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Valve Index (П): касание мини-джойстика"
					},
					"Key": "ValveIndex_Right_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Up"
					},
					"Translation": {
						"Text": "Valve Index (П): мини-джойстик вверх"
					},
					"Key": "ValveIndex_Right_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Valve Index (П): ось X мини-джойстика"
					},
					"Key": "ValveIndex_Right_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Valve Index (П): ось Y мини-джойстика"
					},
					"Key": "ValveIndex_Right_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index (П): 2D-ось сенсорной панели"
					},
					"Key": "ValveIndex_Right_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Down"
					},
					"Translation": {
						"Text": "Valve Index (П): сенсорная панель, нажатие вниз"
					},
					"Key": "ValveIndex_Right_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Force"
					},
					"Translation": {
						"Text": "Valve Index (П): нажатие на сенсорную панель"
					},
					"Key": "ValveIndex_Right_Trackpad_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Left"
					},
					"Translation": {
						"Text": "Valve Index (П): сенсорная панель, нажатие влево"
					},
					"Key": "ValveIndex_Right_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Right"
					},
					"Translation": {
						"Text": "Valve Index (П): сенсорная панель, нажатие вправо"
					},
					"Key": "ValveIndex_Right_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Touch"
					},
					"Translation": {
						"Text": "Valve Index (П): касание сенсорной панели"
					},
					"Key": "ValveIndex_Right_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Up"
					},
					"Translation": {
						"Text": "Valve Index (П): сенсорная панель, нажатие вверх"
					},
					"Key": "ValveIndex_Right_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad X"
					},
					"Translation": {
						"Text": "Valve Index (П): ось X сенсорной панели"
					},
					"Key": "ValveIndex_Right_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Y"
					},
					"Translation": {
						"Text": "Valve Index (П): ось Y сенсорной панели"
					},
					"Key": "ValveIndex_Right_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trigger"
					},
					"Translation": {
						"Text": "Valve Index (П): триггер"
					},
					"Key": "ValveIndex_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Valve Index (П): ось триггера"
					},
					"Key": "ValveIndex_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trigger Touch"
					},
					"Translation": {
						"Text": "Valve Index (П): касание триггера"
					},
					"Key": "ValveIndex_Right_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Virtual"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "VirtualSubCategory"
				},
				{
					"Source": {
						"Text": "Virtual Gamepad Accept"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Virtual_Gamepad_Accept_Key"
				},
				{
					"Source": {
						"Text": "Virtual Gamepad Back"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Virtual_Gamepad_Back_Key"
				},
				{
					"Source": {
						"Text": "Vive (L) Grip"
					},
					"Translation": {
						"Text": "Vive (Л): рукоятка"
					},
					"Key": "Vive_Left_Grip_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Menu"
					},
					"Translation": {
						"Text": "Vive (Л): кнопка «Меню»"
					},
					"Key": "Vive_Left_Menu_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Vive (Л): 2D-ось сенсорной панели"
					},
					"Key": "Vive_Left_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Button"
					},
					"Translation": {
						"Text": "Vive (Л): кнопка сенсорной панели"
					},
					"Key": "Vive_Left_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Down"
					},
					"Translation": {
						"Text": "Vive (Л): сенсорная панель, нажатие вниз"
					},
					"Key": "Vive_Left_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Left"
					},
					"Translation": {
						"Text": "Vive (Л): сенсорная панель, нажатие влево"
					},
					"Key": "Vive_Left_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Right"
					},
					"Translation": {
						"Text": "Vive (Л): сенсорная панель, нажатие вправо"
					},
					"Key": "Vive_Left_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Touch"
					},
					"Translation": {
						"Text": "Vive (Л): касание сенсорной панели"
					},
					"Key": "Vive_Left_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Up"
					},
					"Translation": {
						"Text": "Vive (Л): сенсорная панель, нажатие вверх"
					},
					"Key": "Vive_Left_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad X-Axis"
					},
					"Translation": {
						"Text": "Vive (Л): ось X сенсорной панели"
					},
					"Key": "Vive_Left_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Y-Axis"
					},
					"Translation": {
						"Text": "Vive (Л): ось Y сенсорной панели"
					},
					"Key": "Vive_Left_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Vive (L) Trigger"
					},
					"Translation": {
						"Text": "Vive (Л): триггер"
					},
					"Key": "Vive_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Vive (Л): ось триггера"
					},
					"Key": "Vive_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Vive (R) Grip"
					},
					"Translation": {
						"Text": "Vive (П): рукоятка"
					},
					"Key": "Vive_Right_Grip_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Menu"
					},
					"Translation": {
						"Text": "Vive (П): кнопка «Меню»"
					},
					"Key": "Vive_Right_Menu_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Vive (П): 2D-ось сенсорной панели"
					},
					"Key": "Vive_Right_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Button"
					},
					"Translation": {
						"Text": "Vive (П): кнопка сенсорной панели"
					},
					"Key": "Vive_Right_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Down"
					},
					"Translation": {
						"Text": "Vive (П): сенсорная панель, нажатие вниз"
					},
					"Key": "Vive_Right_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Left"
					},
					"Translation": {
						"Text": "Vive (П): сенсорная панель, нажатие влево"
					},
					"Key": "Vive_Right_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Right"
					},
					"Translation": {
						"Text": "Vive (П): сенсорная панель, нажатие вправо"
					},
					"Key": "Vive_Right_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Touch"
					},
					"Translation": {
						"Text": "Vive (П): касание сенсорной панели"
					},
					"Key": "Vive_Right_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Up"
					},
					"Translation": {
						"Text": "Vive (П): сенсорная панель, нажатие вверх"
					},
					"Key": "Vive_Right_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad X-Axis"
					},
					"Translation": {
						"Text": "Vive (П): ось X сенсорной панели"
					},
					"Key": "Vive_Right_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Y-Axis"
					},
					"Translation": {
						"Text": "Vive (П): ось Y сенсорной панели"
					},
					"Key": "Vive_Right_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Vive (R) Trigger"
					},
					"Translation": {
						"Text": "Vive (П): триггер"
					},
					"Key": "Vive_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Vive (П): ось триггера"
					},
					"Key": "Vive_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Windows Mixed Reality"
					},
					"Translation": {
						"Text": "Windows Mixed Reality"
					},
					"Key": "MixedRealitySubCategory"
				},
				{
					"Source": {
						"Text": "XBox One"
					},
					"Translation": {
						"Text": "Xbox One"
					},
					"Key": "XBoxOneSubCateogry"
				}
			]
		},
		{
			"Namespace": "LinuxDynamicRHI",
			"Children": [
				{
					"Source": {
						"Text": "Failed to load OpenGL Driver which is required to run the engine.\nOpenGL4 has been deprecated and should use Vulkan."
					},
					"Translation": {
						"Text": "Не удалось загрузить драйвер OpenGL, который требуется для работы движка.\nВместо OpenGL4 теперь используется Vulkan."
					},
					"Key": "NoOpenGLDriver"
				},
				{
					"Source": {
						"Text": "Failed to load Vulkan Driver which is required to run the engine.\nThe engine no longer fallbacks to OpenGL4 which has been deprecated."
					},
					"Translation": {
						"Text": "Не удалось загрузить драйвер Vulkan, который требуется для работы движка.\nOpenGL4 больше не поддерживается движком."
					},
					"Key": "NoVulkanDriver"
				},
				{
					"Source": {
						"Text": "Forced Vulkan device could not be created at the project's supported feature levels (see log for details)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ForcedVulkanSM"
				},
				{
					"Source": {
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation": {
						"Text": "Для работы движка игры требуется OpenGL версии 4.3."
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source": {
						"Text": "The project does not target Vulkan or OpenGL RHIs, check project settings or pass -nullrhi."
					},
					"Translation": {
						"Text": "Проект не содержит RHI для Vulkan или OpenGL, проверьте настройки проекта или воспользуйтесь командой -nullrhi."
					},
					"Key": "NoTargetedRHI"
				},
				{
					"Source": {
						"Text": "Trying to force OpenGL RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation": {
						"Text": "Не удалось использовать RHI для OpenGL: его нет в списке обнаруженных RHI выбранного проекта."
					},
					"Key": "NoOpenGLTargetedRHI"
				},
				{
					"Source": {
						"Text": "Trying to force Vulkan RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation": {
						"Text": "Не удалось использовать RHI для Vulkan: его нет в списке обнаруженных RHI выбранного проекта."
					},
					"Key": "NoVulkanTargetedRHI"
				},
				{
					"Source": {
						"Text": "Trying to force specific Vulkan feature level but it is not supported."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UnsupportedVulkanTargetedRHI"
				},
				{
					"Source": {
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation": {
						"Text": "Для работы движка игры требуется драйвер Vulkan."
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source": {
						"Text": "Vulkan device could not be created at the project's supported feature levels (see log for details)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SupportedVulkanSM"
				},
				{
					"Source": {
						"Text": "Vulkan or OpenGL (4.3) support is required to run the engine."
					},
					"Translation": {
						"Text": "Для работы движка игры требуется Vulkan или OpenGL версии 4.3."
					},
					"Key": "NoVulkanNoGL"
				},
				{
					"Source": {
						"Text": "Warning: OpenGL is no longer supported for desktop platforms. Vulkan will be used instead."
					},
					"Translation": {
						"Text": "Внимание: OpenGL больше не поддерживается на компьютерах. Вместо него будет использоваться Vulkan."
					},
					"Key": "OpenGLRemoved"
				}
			]
		},
		{
			"Namespace": "MessageDialog",
			"Children": [
				{
					"Source": {
						"Text": "Please update to the latest version of macOS for best performance and stability."
					},
					"Translation": {
						"Text": "Обновите macOS до последней версии для наилучшей производительности и стабильности."
					},
					"Key": "UpdateMacOSX_Body"
				},
				{
					"Source": {
						"Text": "The installed version of the {Vendor} graphics driver has known issues in {RHI}.\nPlease install either the latest or the recommended driver version or switch to a different rendering API.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation": {
						"Text": "Версия установленного графического драйвера {Vendor} содержит известные ошибки в {RHI}.\nУстановите рекомендуемую или последнюю версию драйвера, либо переключитесь на другой API рендеринга.\n\nПерейти по ссылке и скачать драйвер?\n\n{Hyperlink}\n\n{AdapterName}\nУстановлено: {InstalledVer}\nРекомендуется: {RecommendedVer}"
					},
					"Key": "VideoCardDriverRHIIssueReport"
				},
				{
					"Source": {
						"Text": "The installed version of the {Vendor} graphics driver has known issues.\nPlease install either the latest or the recommended driver version.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation": {
						"Text": "Версия установленного графического драйвера {Vendor} содержит известные ошибки.\nУстановите рекомендуемую или последнюю версию драйвера.\n\nПерейти по ссылке и скачать драйвер?\n\n{Hyperlink}\n\n{AdapterName}\nУстановлено: {InstalledVer}\nРекомендуется: {RecommendedVer}"
					},
					"Key": "VideoCardDriverIssueReport"
				},
				{
					"Source": {
						"Text": "Update macOS"
					},
					"Translation": {
						"Text": "Обновить macOS"
					},
					"Key": "UpdateMacOSX_Title"
				},
				{
					"Source": {
						"Text": "WARNING: Known issues with graphics driver"
					},
					"Translation": {
						"Text": "ВНИМАНИЕ: данный драйвер видеоадаптера может вызывать проблемы."
					},
					"Key": "TitleVideoCardDriverIssue"
				},
				{
					"Source": {
						"Text": "https://downloadcenter.intel.com/product/80939/Graphics"
					},
					"Translation": {
						"Text": "https://downloadcenter.intel.com/ru/product/80939/Graphics"
					},
					"Key": "DriverDownloadLinkIntel"
				},
				{
					"Source": {
						"Text": "https://softwarecenter.qualcomm.com/catalog/item/Windows_Graphics_Driver"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DriverDownloadLinkQualcomm"
				},
				{
					"Source": {
						"Text": "https://www.amd.com/en/support"
					},
					"Translation": {
						"Text": "https://www.amd.com/ru/support"
					},
					"Key": "DriverDownloadLinkAMD"
				},
				{
					"Source": {
						"Text": "https://www.nvidia.com/en-us/geforce/drivers/"
					},
					"Translation": {
						"Text": "https://www.nvidia.com/ru-ru/geforce/drivers/"
					},
					"Key": "DriverDownloadLinkNVIDIA"
				},
				{
					"Source": {
						"Text": "latest driver available"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "LatestDriver"
				},
				{
					"Source": {
						"Text": "{0} or latest driver available"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SuggestedDriverOrLatest"
				}
			]
		},
		{
			"Namespace": "UnrealBuildConfigurations",
			"Children": [
				{
					"Source": {
						"Text": "Debug"
					},
					"Translation": {
						"Text": "Отладка"
					},
					"Key": "DebugName"
				},
				{
					"Source": {
						"Text": "DebugGame"
					},
					"Translation": {
						"Text": "Отладка игры"
					},
					"Key": "DebugGameName"
				},
				{
					"Source": {
						"Text": "Development"
					},
					"Translation": {
						"Text": "Разработка"
					},
					"Key": "DevelopmentName"
				},
				{
					"Source": {
						"Text": "Shipping"
					},
					"Translation": {
						"Text": "Версия"
					},
					"Key": "ShippingName"
				},
				{
					"Source": {
						"Text": "Test"
					},
					"Translation": {
						"Text": "Тест"
					},
					"Key": "TestName"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "Неизвестно"
					},
					"Key": "UnknownName"
				}
			]
		},
		{
			"Namespace": "WindowsDynamicRHI",
			"Children": [
				{
					"Source": {
						"Text": "-d3d12/dx12, -d3d11/dx11, -vulkan, and -opengl are mutually exclusive options, but more than one was specified on the command-line."
					},
					"Translation": {
						"Text": "Параметры -d3d12/dx12, -d3d11/dx11, -vulkan и -opengl несовместимы друг с другом, при этом в командной строке указано более одного параметра."
					},
					"Key": "RHIOptionsError"
				},
				{
					"Source": {
						"Text": "<Unknown>"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UnknownRHI"
				},
				{
					"Source": {
						"Text": "<unknown>"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelUnknown"
				},
				{
					"Source": {
						"Text": "A D3D11-compatible GPU (Feature Level 11.0, Shader Model 5.0) is required to run the engine."
					},
					"Translation": {
						"Text": "Для работы движка игры требуется графический процессор с поддержкой D3D11 (уровень функций 11.0, шейдерная модель 5.0)."
					},
					"Key": "RequiredDX11Feature_11_SM5"
				},
				{
					"Source": {
						"Text": "DX12 SM6 is not supported on your system. Try running without the -sm6 command line argument."
					},
					"Translation": {
						"Text": "Ваша система не поддерживает DX12 SM6. Попробуйте запустить без параметра командной строки -sm6."
					},
					"Key": "RequiredDX12SM6"
				},
				{
					"Source": {
						"Text": "DX12 is not supported on your system. Try running without the -dx12 or -d3d12 command line argument."
					},
					"Translation": {
						"Text": "Ваша система не поддерживает DX12. Попробуйте запустить игру без параметров -dx12 или -d3d12 в командной строке."
					},
					"Key": "RequiredDX12"
				},
				{
					"Source": {
						"Text": "DirectX 11"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "D3D11"
				},
				{
					"Source": {
						"Text": "DirectX 12"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "D3D12"
				},
				{
					"Source": {
						"Text": "ES3_1"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelES31"
				},
				{
					"Source": {
						"Text": "OpenGL"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenGL"
				},
				{
					"Source": {
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation": {
						"Text": "Для работы движка игры требуется OpenGL версии 4.3."
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source": {
						"Text": "SM5"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelSM4"
				},
				{
					"Source": {
						"Text": "SM6"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelSM6"
				},
				{
					"Source": {
						"Text": "Unable to launch with RHI '{0}' since the project is not configured to support it."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MissingTargetedShaderFormats"
				},
				{
					"Source": {
						"Text": "Vulkan"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Vulkan"
				},
				{
					"Source": {
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation": {
						"Text": "Для работы движка игры требуется драйвер Vulkan."
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source": {
						"Text": "{0} does not support {1}."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RHINotSupported"
				}
			]
		}
	]
}